package cc.gps.data.jt808;

public class VWarns {
	  public final static long[] WS={
		1                        ,//0    
		2                        ,//1 
		4                        ,//2 
		8                        ,//3 
		16                       ,//4 
		32                       ,//5 
		64                       ,//6 
		128                      ,//7 
		256                      ,//8 
		512                      ,//9 
		1024                     ,//10
		2048                     ,//11
		4096                     ,//12
		8192                     ,//13
		16384                    ,//14
		32768                    ,//15
		65536                    ,//16
		131072                   ,//17
		262144                   ,//18
		524288                   ,//19
		1048576                  ,//20
		2097152                  ,//21
		4194304                  ,//22
		8388608                  ,//23
		16777216                 ,//24
		33554432                 ,//25
		67108864                 ,//26
		134217728                ,//27
		268435456                ,//28
		536870912                ,//29
		1073741824               ,//30
		2147483648l               //31
	};
	public final static String[] WSINFO={
		"紧急报警",                    //0  
		"超速报警",                    //1
		"疲劳驾驶",                    //2
		"危险预警",                        //3
		"GNSS模块发生故障",            //4
		"GNSS天线未接或被剪断",        //5
		"GNSS天线短路",                //6
		"终端主电源欠压",              //7
		"终端主电源掉电",              //8
		"终端LCD或显示器故障",              //9
		"TTS模块故障",         //10
		"摄像头故障",                  //11
		
		"道路运输证IC卡模块故障",       //12 GPS信号报警:超时无信号 lz 
		"超速预警",                        //13  
		"疲劳驾驶预警 ",                        //14  
		"",                     //15   
		"",                            //16
		"",                            //17
		"当天累计驾驶超时",            //18
		"超时停车",                    //19
		"进出区域",                    //20
		"进出路线",                    //21
		"路段行驶时间不足／过长",      //22
		"路线偏离报警",                //23
		"车辆VSS故障",                 //24
		"车辆油量异常",                //25
		"车辆被盗",                    //26
		"车辆非法点火",                //27
		"车辆非法位移",                //28
		"碰撞侧翻报警",                //29
		"侧翻预警",                            //30
		"非法开门报警"                             //31              
	};
}
